:PROPERTIES:
:ID:       e1bab25e-c1c8-46d2-b265-8bb510d99f6e
:END:
#+title: partitions and filesystems

[[file:20200418155222_homeit.org][R:@information technology]]

* reserved blocks

5% of disk space is reserved on ext? filesystems.
useful for root partitions, not that great for data partitions where no system processes uses.

** check reserved block counts

Use `lsblk` to find your partition device names.

#+BEGIN_SRC bash
tune2fs -l /dev/sdb1  | grep 'reserved block count'
#+END_SRC

#+RESULTS:
| Reserved block count:     48837696 |



You can then double check to see if it worked:
# tune2fs -l /dev/sdb1  | grep 'reserved block count'

Reserved block count:     0
** Change reserved block allocation

You will use the -m attribute of tune2fs

#+BEGIN_SRC bash
tune2fs -m0  /dev/sdb1
#+END_SRC

#+RESULTS:
| tune2fs 1.45.5 (07-Jan-2020                         |
| Setting reserved blocks percentage to 0% (0 blocks) |

